COMPANIES = {
    "4823006703": "NLMK",   # НЛМК
    "7712040126": "AFLT",   # Аэрофлот
    "7736050003": "GAZP",   # Газпром

    "7736216869": "PHOR",
    # "7536033929": "CHMF",
    # "8604035373": "SNGS", 
    "8401005730": "GMKN",
    # "7736033003": "SIBN",
    # "2463000007": "PLZL",
    "7731581426": "NVTK",

    # Oils
    "7708004767": "LKOH",   # Лукойл
    "7706107510": "ROSN",
    "1644003838": "TATN",
    "7706061801": "TRNFP",

    # Finance
    "7707083893": "SBER",
    "7702070139": "VTBR",
    "7831000027": "BSPB",
    "7702077840": "MOEX",
    "7801268965": "SPBE",
    "4401116480": "SVCB",
    "7718011918": "RDRB",
    "7707600245": "MGKL",
    "7729355614": "DOMRF",
    "7725497022": "RENI",
    "5406836941": "ZAYM",
    "2540283195": "T",
    "7702045051": "MBNK",
    "6164077483": "SFIN",
    "9705101614": "LEAS",
    "7707067683": "RGSS",
    "0274062111": "USBN",
    "7734202860": "CBOM",
    "5836900162": "KUZB",
    "2536020789": "PRMB",
    "7702021163": "AVAN",
    "7801268965": "SPBE",
    "9704168849": "CARM",
    "7703104630": "AFKS",
    "7840303927": "ARSA",
    "7704081545": "RUSI",

    # Tech Sector
    "7714716995": "NSVZ",
    "7736227885": "SOFL",
    "3900015862": "VKCO",
    "9715302870": "DIAS",
    "7726476459": "ASTR",
    "9722103241": "BAZA",
    "9718077239": "POSI",
    "9717163245": "DATA",
    "1683020450": "IVAT",
    "3900019850": "YDEX",
    "3900045916": "OZON",

    # Utilities
    "6450925977": "MRKV",

    # HealthCare
    "9702034818": "PRMD",
    "7736317497": "GEMA",
    "6320080729": "OZPH",
    "3900020125": "GEMC",
    "7725024805": "DIOD",
    "9731078633": "GECO",
    "7801075160": "LIFE",
    "3900026494": "MDMG",

    # Retail
    "9722079341": "X5",
    "3906399157": "LENT",
    "2309085638": "MGNT",
    "7743462664": "FIXR",
}


TICKER_TO_INN = {ticker: inn for inn, ticker in COMPANIES.items()}


def get_ticker_by_inn(inn: str) -> str:
    return COMPANIES.get(inn, inn)


def get_inn_by_ticker(ticker: str) -> str | None:
    return TICKER_TO_INN.get(ticker)